---
kind: type
id: T:Autodesk.Revit.DB.PartsVisibility
source: html/95aab269-5f16-1080-6948-11dd7535af08.htm
---
# Autodesk.Revit.DB.PartsVisibility

Indicates the visibility of parts for the view.

## Syntax (C#)
```csharp
public enum PartsVisibility
```